app/controllers/statistic_controller.rb

  def index
    @web_test = WebTest.find(params[:web_test_id]) rescue nil
    return (redirect_to root_path) if @web_test.nil?

    @web_task = params[:web_task_id] ? @web_test.web_tasks.find(params[:web_task_id]) : @web_test.web_tasks.first
---
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 1 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort

  def memory_data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("Memory")

        data1 = []
        data2 = []
        data3 = []
        max_value = 0

        data_x = []

        WebTest.find(params[:web_test_id]).web_tasks.find(params[:web_task_id]).web_results.each do |web_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 2)
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC

  def cpu_data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("CPU")

        data1 = []
        data2 = []
        data3 = []
        max_value = 0

        data_x = []

        WebTest.find(params[:web_test_id]).web_tasks.find(params[:web_task_id]).web_results.each do |web_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 2)
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC

  def swap_data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("Swap")

        data1 = []
        data2 = []
        data3 = []
        max_value = 0

        data_x = []

        WebTest.find(params[:web_test_id]).web_tasks.find(params[:web_task_id]).web_results.each do |web_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 2)
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC

  def process_data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("Process")

        data1 = []
        data2 = []
        data3 = []
        max_value = 0

        data_x = []

        WebTest.find(params[:web_test_id]).web_tasks.find(params[:web_task_id]).web_results.each do |web_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 2)
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC

  def web_data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("Web statistic")

        data1 = []
        data2 = []
        data3 = []
        max_value = 0

        data_x = []

        WebTest.find(params[:web_test_id]).web_tasks.find(params[:web_task_id]).web_results.each do |web_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 2)
SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2 AND (`web_tasks`.web_test_id = 1)) ORDER BY sort
SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC