app/controllers/statistic_controller.rb

  def data
    respond_to do |response|
      response.js {
        # based on this example - http://teethgrinder.co.uk/open-flash-chart-2/data-lines-2.php
        title = Title.new("Multiple Lines")

        data1 = []
        data2 = []
        max_value = 0
        WebTask.first.web_url_results.each do |web_url_result|
---
SELECT * FROM `web_results` WHERE (`web_results`.web_url_result_id = 1) LIMIT 1
SELECT * FROM `web_tasks` ORDER BY sort LIMIT 1
SELECT * FROM `web_url_results` WHERE (`web_url_results`.web_task_id = 1) ORDER BY created_at