app/controllers/statistic_comparison_controller.rb

SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2) ORDER BY sort
---
  def index
    @main_selector = WebTask.done_all
    if params[:web_task_id1] && params[:web_task_id2]
      @web_task1 = WebTask.find(params[:web_task_id1]) rescue nil

SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 3) ORDER BY sort
SELECT * FROM `web_results` WHERE (`web_results`.web_task_id = 3)
---
  def data
    if params[:web_task_id1] && params[:web_task_id2] && params[:compare_method]
      @web_task1 = WebTask.find(params[:web_task_id1]) rescue nil
      @web_task2 = WebTask.find(params[:web_task_id2]) rescue nil
      return (redirect_to root_path) if @web_task1.nil? || @web_task2.nil?

      #cpu
      case params[:compare_method]
        when "web"
          title = Title.new("Web load")

          data1 = []
          data2 = []
          max_value = 0

          data_x = []

          @web_task1.web_results.each do |web_result|