app/controllers/web_task_controller.rb

INSERT INTO `web_tasks` (`http_params`, `name`, `created_at`, `http_method`, `updated_at`, `url`, `count_repeat`, `sort`, `web_test_id`) VALUES('', 'Get test', '2010-04-05 09:06:10', 0, '2010-04-05 09:06:10', 'http://films.leo.local/frontend_dev.php/', 50, 0, 1)
---
  def create
    @web_task = WebTask.new(params[:web_task])
    if @web_task.save

SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 1) ORDER BY sort
---
  def edit
    @web_task = WebTask.find(params[:id])

SELECT * FROM "web_tasks" WHERE ("web_tasks"."id" = 1) ORDER BY sort
UPDATE "web_tasks" SET "updated_at" = '2010-04-01 16:43:40', "url" = 'http://films.leo.local/frontend_dev.php/' WHERE "id" = 2
---
  def update
    @web_task = WebTask.find(params[:id])
    if @web_task.update_attributes(params[:web_task])

SELECT * FROM "web_tasks" WHERE ("web_tasks"."id" = 1) ORDER BY sort
DELETE FROM "web_tasks" WHERE "id" = 1
---
  def destroy
    @web_task = WebTask.find(params[:id])
    @web_task.destroy if @web_task

SELECT * FROM `web_tasks` WHERE (`web_tasks`.`id` = 2) ORDER BY sort
UPDATE `web_tasks` SET `updated_at` = '2010-04-05 09:18:13', `sort` = 1 WHERE `id` = 2
---
  def sort
    if params[:sort_box] && params[:sort_box].is_a?(Array)
      i = 1
      params[:sort_box].each do |id|
        if web_task = WebTask.find(id)
          web_task.update_attribute(:sort, i)