app/controllers/web_test_controller.rb

SELECT * FROM "web_tests" ORDER BY name, created_at DESC LIMIT 20 OFFSET 0
---
  def index
    @web_tests = WebTest.paginate :per_page => 20, :page => params[:page]

INSERT INTO "web_tests" ("name", "created_at", "resulted_at", "updated_at", "launched") VALUES('First test', '2010-03-28 19:56:00', NULL, '2010-03-28 19:56:00', 'f')
---
  def create
    @web_test = WebTest.new(params[:web_test])
    if @web_test.save

SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC
---
  def show
    @web_test = WebTest.find(params[:id])

SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC
---
  def edit
    @web_test = WebTest.find(params[:id])

SELECT * FROM "web_tests" WHERE ("web_tests"."id" = 1) ORDER BY created_at DESC
---
  def update
    @web_test = WebTest.find(params[:id])

SELECT * FROM `web_tests` WHERE (`web_tests`.`id` = 1) ORDER BY created_at DESC
---
  def start
    web_test = WebTest.find(params[:id]) if params[:id]